Repository: tianpingdeng112233-cell/meetpr
Catalog: Modules/StudentKit/Sources/StudentKit/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en

# student.trainingCalendarLogic.copy012
source: 练完 W{0} · {1} 后自动轮到这一节。
en: This session unlocks after W{0} · {1} is completed.

# student.trainingCalendarLogic.copy013
source: {0} 个动作 · {1} 组
en: Exercises: {0} · Sets: {1}

# student.trainingCalendarView.copy001
source: 计划汇总
en: Plan summary

# student.trainingCalendarView.copy002
source: 已完成 {0} / {1} 节
en: Completed {0} / {1} sessions

# student.trainingCalendarView.copy003
source: {0} / {1} 节
en: {0} / {1} sessions

# student.trainingCalendarView.copy004
source: 0 节
en: 0 sessions

# student.trainingCalendarView.copy005
source: {0} 节 · {1} 起
en: {0} sessions · from {1}

# student.trainingCalendarView.copy006
source: 本周
en: This week

# student.trainingHistoryView.copy001
source: E1RM vs 训练 1RM
en: e1RM vs training 1RM

# student.trainingHistoryView.copy002
source: 教练反馈记录
en: Coach feedback history

# student.trainingHistoryView.copy003
source: 全部历史
en: All history

# student.trainingHistoryView.copy004
source: 全部训练历史
en: All training history

# student.trainingHistoryView.copy005
source: 第一次训练后解锁
en: Unlocks after your first workout

# student.trainingHistoryView.copy006
source: 按周 / 月查看 · 含每组数据
en: View by week or month · Includes every set

# student.trainingHistoryView.copy007
source: 打开训练历史列表
en: Open training history

# student.trainingHistoryView.copy008
source: 容量 / 强度
en: Volume / Intensity

# student.trainingHistoryView.copy009
source: 全部教练反馈
en: All coach feedback

# student.trainingHistoryView.copy010
source: 共 {0} 条 · 含视频回放
en: {0} total · Includes video playback

# student.trainingHistoryView.copy011
source: 完成训练后，教练点评会归档在这里
en: Your coach's feedback will be saved here after each workout

# student.trainingHistoryView.copy012
source: 消息与通知
en: Messages and notifications

# student.trainingHistoryView.copy013
source: 成长
en: Progress

# student.trainingHistoryView.copy014
source: E1RM ＝ 用你完成的组数估算的单次最大重量
en: e1RM = your estimated one-rep max based on completed sets

# student.trainingHistoryView.copy015
source: 三项 E1RM 合计
en: Big-three e1RM total

# student.trainingHistoryView.copy016
source: 训练 1RM 合计
en: Training 1RM total

# student.trainingHistoryView.copy017
source: 已突破训练 1RM · {0}%
en: Exceeded training 1RM · {0}%

# student.trainingHistoryView.copy018
source: 训练次数
en: Training sessions

# student.trainingHistoryView.copy019
source: 训练周
en: Training week

# student.trainingHistoryView.copy020
source: 训练总容量
en: Total training volume

# student.trainingHistoryView.copy021
source: 正在加载成长数据
en: Loading progress data

# student.trainingHistoryView.copy022
source: 加载失败
en: Failed to load

# student.trainingHistoryView.copy023
source: 重试
en: Retry

# student.trainingHistoryView.copy024
source: 训练历史
en: Training history

# student.trainingReminderCopy.copy001
source: 关
en: Off

# student.trainingReminderCopy.copy002
source: 未选择星期
en: No days selected

# student.trainingReminderCopy.copy003
source: 训练日到了
en: Training day is here

# student.trainingReminderCopy.copy004
source: 该练了，今天的安排在等你
en: Time to train. Today's plan is waiting for you.

# student.trainingReminderPreferenceRow.copy001
source: 训练提醒
en: Training reminders

# student.trainingReminderSettingsView.copy001
source: 训练提醒
en: Training reminders

# student.trainingReminderSettingsView.copy002
source: 开启训练提醒
en: Enable training reminders

# student.trainingReminderSettingsView.copy003
source: 提醒时间
en: Schedule

# student.trainingReminderSettingsView.copy004
source: 星期
en: Days

# student.trainingReminderSettingsView.copy005
source: 时间
en: Time

# student.trainingReminderSettingsView.copy006
source: 通知权限未开启
en: Notification permission is off

# student.trainingReminderSettingsView.copy007
source: 去设置
en: Settings

# student.trainingReminderSettingsView.copy008
source: 提醒设置失败,请重试
en: Couldn't schedule reminders. Please try again.

# student.trainingReminderWeekday.copy001
source: 一
en: Mon

# student.trainingReminderWeekday.copy002
source: 二
en: Tue

# student.trainingReminderWeekday.copy003
source: 三
en: Wed

# student.trainingReminderWeekday.copy004
source: 四
en: Thu

# student.trainingReminderWeekday.copy005
source: 五
en: Fri

# student.trainingReminderWeekday.copy006
source: 六
en: Sat

# student.trainingReminderWeekday.copy007
source: 日
en: Sun

# student.trainingShareConversationFailed
source: 暂时无法进入教练会话，请稍后重试。
en: Cannot open the coach conversation right now. Try again later.

# student.trainingShareFailed
source: 无法分享训练记录
en: Cannot share training log

# student.unreadSuffix
source: 条未读
en: unread

# student.uploadFailureNotifier.copy001
source: 训练视频上传失败
en: Training video upload failed

# student.uploadFailureNotifier.copy002
source: 有 {0} 条训练视频没传成功，打开看看
en: {0} training videos failed to upload. Open to review

# student.videoAttachmentSection.copy001
source: 视频
en: Video

# student.videoAttachmentSection.copy002
source: 重试
en: Retry

# student.videoAttachmentSection.copy003
source: 视频暂时无法播放,请重试
en: Video is temporarily unavailable. Try again

# student.videoAttachmentSection.copy004
source: 视频加载失败,请检查网络后重试
en: Could not load video. Check your connection and try again

# student.videoAttachmentV3Controls.copy001
source: 拍摄
en: Record

# student.videoAttachmentV3Controls.copy002
source: 相册
en: Photos

# student.videoAttachmentV3Controls.copy003
source: 处理中…
en: Processing…

# student.videoAttachmentV3Controls.copy004
source: 更换
en: Change

# student.videoAttachmentV3Controls.copy005
source: 删除
en: Delete

# student.videoAttachmentV3Controls.copy006
source: 已送达教练
en: Delivered to coach

# student.videoAttachmentV3Controls.copy007
source: 还在路上
en: Sending

# student.videoAttachmentV3Controls.copy008
source: 上传失败
en: Upload failed

# student.videoAttachmentV3Controls.copy009
source: 重试
en: Retry

# student.videoAttachmentV3Previews.copy001
source: 视频
en: Video

# student.videoAttachmentViewModel.copy001
source: 视频处理失败,请重试
en: Could not process video. Try again

# student.videoAttachmentViewModel.copy002
source: 本地视频已不存在,请删除后重新选择
en: The local video is missing. Delete it and choose another video

# student.videoAttachmentViewModel.copy003
source: 视频超过 {0} 秒上限,请截短后再上传
en: The video exceeds the {0}-second limit. Trim it before uploading

# student.videoAttachmentViewModel.copy004
source: 视频转码失败,请重试
en: Could not transcode video. Try again

# student.videoPrivacyCopy.copy001
source: 视频上传须知
en: About video uploads

# student.videoPrivacyCopy.copy002
source: 你上传的训练视频将仅你绑定的教练可见。MeetPR 不会向其他人公开你的视频。
en: Only your connected coach can see the training videos you upload. MeetPR will not make them public.

# student.videoPrivacyCopy.copy003
source: 同意上传
en: Agree and upload

# student.videoPrivacyCopy.copy004
source: 不上传
en: Do not upload

# student.videoTrimTimeline.copy001
source: 已选 {0}
en: Selected {0}

# student.videoTrimTimeline.copy002
source: 视频裁剪区间
en: Video trim range

# student.videoTrimTimeline.copy003
source: 裁剪起点
en: Trim start

# student.videoTrimTimeline.copy004
source: 裁剪终点
en: Trim end

# student.videoTrimView.copy001
source: 正在读取视频…
en: Loading video…

# student.videoTrimView.copy002
source: 编辑视频
en: Edit video

# student.videoTrimView.copy003
source: 保存
en: Save

# student.videoTrimView.copy004
source: 暂停
en: Pause

# student.videoTrimView.copy005
source: 播放
en: Play

# student.volumeIntensityChart.copy001
source: 训练容量 kg
en: Training volume kg

# student.volumeIntensityChart.copy002
source: 平均 RPE
en: Average RPE

# student.volumeIntensityChart.copy003
source: 完成 3 次训练后解锁趋势
en: Complete 3 workouts to unlock trends

# student.volumeIntensityChart.copy004
source: 容量和平均 RPE 趋势图，共 {0} 周
en: Volume and average RPE trend chart over {0} weeks

# student.w4V3Previews.copy001
source: 深蹲
en: Squat

# student.w4V3Previews.copy002
source: 深蹲第一组速度很好，下一次保持同样节奏，最后一组不要急着起杠。
en: Your first squat set moved well. Keep the same tempo next time and stay patient off the floor on the last set.

# student.w4V3Previews.copy003
source: 李明
en: Ming Li

# student.w4V3Previews.copy004
source: 卧推
en: Bench press

# student.w4V3Previews.copy005
source: 硬拉
en: Deadlift

# student.workoutCompletionFlowView.copy001
source: 今日训练完成
en: Today's workout completed

# student.workoutCompletionFlowView.copy002
source: 查看详细报告
en: View full report

# student.workoutCompletionFlowView.copy003
source: 完成
en: Done

# student.workoutCompletionFlowView.copy004
source: 教
en: Coach

# student.workoutCompletionFlowView.copy005
source: /{0} 组
en: /{0} sets

# student.workoutCompletionFlowView.copy006
source: {0} 组成功完成
en: {0} sets completed successfully

# student.workoutCompletionFlowView.copy007
source: 连续第 {0} 次训练
en: {0}-workout streak

# student.workoutCompletionPresentation.copy001
source: {0} 组 · {1} 失败
en: Sets: {0} · Failed: {1}

# student.workoutCompletionPresentation.copy002
source: {0} 组 全部完成
en: All {0} sets completed

# student.workoutCompletionPresentation.copy003
source: {0} 次 · 主项 RPE {1} · {2}
en: {0} reps · Main-lift RPE {1} · {2}

# student.workoutCompletionPresentation.copy004
source: {0} 追平/刷新最佳纪录
en: {0} matched/new PRs

# student.workoutCompletionPresentation.copy005
source: 降重完成 {0} 组
en: Completed {0} sets with reduced weight

# student.workoutCompletionPresentation.copy006
source: 全部完成
en: All completed

# student.workoutCompletionPresentation.copy007
source: 较上次 {0}{1}%
en: vs last time {0}{1}%

# student.workoutCompletionPresentation.copy008
source: 按计划完成
en: Completed as planned

# student.workoutCompletionPresentation.copy009
source: 暂无 RPE
en: No RPE

# student.workoutCompletionPresentation.copy010
source: 符合计划
en: On plan

# student.workoutCompletionPresentation.copy011
source: 高于计划
en: Above plan

# student.workoutCompletionPresentation.copy012
source: 低于计划
en: Below plan

# student.workoutCompletionPresentation.copy013
source: 本周训练
en: This week's training

# student.workoutCompletionPresentation.copy014
source: 本周第 {0} 练
en: Workout {0} this week

# student.workoutCompletionPresentation.copy015
source: 教练已收到你的训练日志
en: Your coach received your training log

# student.workoutCompletionPresentation.copy016
source: {0}已收到你的训练日志
en: {0} received your training log

# student.cameraRecorderComponents.copy002.one
source: 剩余 {0} 秒
en: {0} second remaining

# student.dashboardE1Rmrail.copy003.one
source: E1RM · {0} 天
en: e1RM · {0} day

# student.dashboardPrimaryAction.copy006.one
source: {0} 周计划已全部完成
en: The {0}-week plan is complete

# student.dashboardPrimaryAction.copy007.one
source: W1 – W{0} · 共 {1} 节
en: W1–W{0} · {1} session total

# student.dashboardProfileMetricsView.copy005.one
source: 距比赛 {0} 天
en: {0} day until meet

# student.dayCompletionBanner.copy001.one
source: 今日训练完成 · {0} 组
en: Today's workout completed · {0} set

# student.dayCompletionBanner.copy003.one
source: 今日训练完成，共 {0} 组，点按查看训练回顾
en: Today's workout completed, {0} set total. Tap to view the workout review

# student.feedbackVideoPresentation.copy002.one
source: {0}kg×{1}次
en: {0} kg × {1} rep

# student.feedbackVideoPresentation.copy003.one
source: {0}次
en: {0} rep

# student.growthE1Rmcard.copy005.one
source: {0} E1RM {1} 个趋势点
en: {0} e1RM · {1} trend point

# student.growthEmptyStates.copy005.one
source: 次{0}，虚线就变成你的曲线
en: more {0} session to turn the dashed line into your chart

# student.historyEntriesView.copy004.one
source: {0}/{1} 组
en: {0}/{1} set

# student.myProfileV3Presentation.copy009.one
source: {0}部伤病
en: {0} injury

# student.onboardingLabels.copy047.one
source: {0} 年
en: {0} year

# student.onboardingSummaryFormatter.copy005.one
source: {0} ({1}天/周)
en: {0} ({1} day/week)

# student.pendingBindView.copy012.one
source: {0} 份上传资料
en: {0} uploaded item

# student.pendingBindViewModel.copy004.one
source: {0} 分钟
en: {0} minute

# student.step4EnvironmentSection.copy006.one
source: 已选 {0} 天/周 — 至少选 2 天
en: {0} day/week selected — Select at least 2 days

# student.todayWorkoutScreen.copy018.one
source: 共 {0} 个动作 ·
en: {0} exercise total ·

# student.todayWorkoutScreen.copy019.one
source: {0} 组
en: {0} set

# student.todayWorkoutScreen.copy020.one
source: {0} × {1} · {2} 组
en: {0} × {1} · {2} set

# student.trainingCalendarView.copy002.one
source: 已完成 {0} / {1} 节
en: Completed {0} / {1} session

# student.trainingCalendarView.copy003.one
source: {0} / {1} 节
en: {0} / {1} session

# student.trainingCalendarView.copy005.one
source: {0} 节 · {1} 起
en: {0} session · from {1}

# student.uploadFailureNotifier.copy002.one
source: 有 {0} 条训练视频没传成功，打开看看
en: {0} training video failed to upload. Open to review

# student.volumeIntensityChart.copy004.one
source: 容量和平均 RPE 趋势图，共 {0} 周
en: Volume and average RPE trend chart over {0} week

# student.workoutCompletionFlowView.copy005.one
source: /{0} 组
en: /{0} set

# student.workoutCompletionFlowView.copy006.one
source: {0} 组成功完成
en: {0} set completed successfully

# student.workoutCompletionPresentation.copy002.one
source: {0} 组 全部完成
en: All {0} set completed

# student.workoutCompletionPresentation.copy003.one
source: {0} 次 · 主项 RPE {1} · {2}
en: {0} rep · Main-lift RPE {1} · {2}

# student.workoutCompletionPresentation.copy004.one
source: {0} 追平/刷新最佳纪录
en: {0} matched/new PR

# student.workoutCompletionPresentation.copy005.one
source: 降重完成 {0} 组
en: Completed {0} set with reduced weight
